hiperiondev/esp32idf_APRS/components/message/message.c
// @file message.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief APRS text messaging implementation: outgoing message and ACK
// formatting, incoming message parsing and acknowledgement, retry/timeout
// handling of the in-memory queue.

#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_timer.h"

#include "BMP180.h" // bmp180_gpio_is_reserved(): keep the I2C pins out of the alarm pin
#include "afsk.h"   // afsk_ptt_gpio_is_valid(), MODEM_ADC_GPIO / MODEM_DAC_GPIO (checked internally by afsk_ptt_gpio_is_valid())
#include "app_config.h"
#include "aprs_path.h"                          // aprs_path_build_suffix_from_config()
#include "esp32idf_radioamateur_modem_config.h" // MODEM_PTT_GPIO: the fixed PTT pin, checked directly below
#include "json_escape.h"                        // json_escape()
#include "message.h"
#include "query.h" // query_process_directed(): second consumer of the ::ADDRESSEE: payload, for "CALL:?query?"
#include "str_append.h"

static const char *TAG = "message";

#define MSG_ALARM_PULSE_MS 1000

static msg_entry_t s_queue[MSG_QUEUE_SIZE];
static uint16_t s_msgID = 0;
static void (*s_txHandler)(const char *packet, size_t len, uint8_t channels) = NULL;

void message_set_tx_handler(void (*handler)(const char *packet, size_t len, uint8_t channels)) {
    s_txHandler = handler;
}

void message_init(void) {
    memset(s_queue, 0, sizeof(s_queue));
}

// ---------------------------------------------------------------------------
// Message Alarm GPIO: driven to 1 for MSG_ALARM_PULSE_MS whenever a direct
// message addressed to g_config.msg_mycall is received, then back to 0 until
// the next one. Disabled by default (g_config.msg_alarm_enable == false /
// g_config.msg_alarm_gpio == -1).
// ---------------------------------------------------------------------------
static int8_t s_alarmGpio = -1;
static esp_timer_handle_t s_alarmTimer = NULL;

bool message_alarm_gpio_is_valid(int8_t gpio) {
    if (gpio == -1)
        return true; // "disabled" is always accepted

    // Output-capable, not the input-only pads, not the internal flash/PSRAM
    // pads, and not colliding with the audio modem's ADC/DAC - same rules
    // as the PTT pin (see afsk_ptt_gpio_is_valid()).
    if (!afsk_ptt_gpio_is_valid(gpio))
        return false;

    // Reject a GPIO already used by the PTT pin, a fixed compile-time
    // constant (MODEM_PTT_GPIO).
    if (gpio == MODEM_PTT_GPIO)
        return false;

    // Not already used by any sensors_local peripheral bus. (These fields are
    // config-struct-only placeholders with no driver behind them yet - see
    // the same note in web_gpio_collect_used() - so they're not checked here;
    // only pins that are genuinely wired to something (PTT above, BMP180 I2C
    // via bmp180_gpio_is_reserved()) can make a GPIO invalid.)
    if (bmp180_gpio_is_reserved(gpio))
        return false;

    return true;
}

static void alarmTimerCb(void *arg) {
    (void)arg;
    if (s_alarmGpio >= 0)
        gpio_set_level((gpio_num_t)s_alarmGpio, 0);
}

void message_alarm_configure(bool enable, int8_t gpio) {
    int8_t new_gpio = (enable && message_alarm_gpio_is_valid(gpio)) ? gpio : -1;

    if (s_alarmTimer)
        esp_timer_stop(s_alarmTimer); // no-op if not running

    // Release the previous pin (disabling, or switching to a different one)
    // so a stale output isn't left driving.
    if (s_alarmGpio >= 0 && s_alarmGpio != new_gpio) {
        gpio_set_level((gpio_num_t)s_alarmGpio, 0);
        gpio_set_direction((gpio_num_t)s_alarmGpio, GPIO_MODE_INPUT);
    }

    s_alarmGpio = new_gpio;

    if (s_alarmGpio < 0)
        return;

    if (!s_alarmTimer) {
        const esp_timer_create_args_t args = {
            .callback = alarmTimerCb,
            .name = "msg_alarm",
        };
        if (esp_timer_create(&args, &s_alarmTimer) != ESP_OK) {
            ESP_LOGW(TAG, "Message Alarm: failed to create timer, disabling");
            s_alarmGpio = -1;
            return;
        }
    }

    gpio_reset_pin((gpio_num_t)s_alarmGpio);
    gpio_set_direction((gpio_num_t)s_alarmGpio, GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)s_alarmGpio, 0); // idle low until a message arrives
    ESP_LOGI(TAG, "Message Alarm: GPIO%d enabled", (int)s_alarmGpio);
}

// Pulses the alarm pin high for MSG_ALARM_PULSE_MS. Called each time a direct
// message for g_config.msg_mycall is received. Re-arms the timer on every
// call, so back-to-back messages keep the pin high without flickering, and it
// only drops back to 0 once MSG_ALARM_PULSE_MS elapses with no new message.
static void message_alarm_pulse(void) {
    if (s_alarmGpio < 0 || !s_alarmTimer)
        return;

    gpio_set_level((gpio_num_t)s_alarmGpio, 1);
    esp_timer_stop(s_alarmTimer); // no-op if not currently running
    esp_timer_start_once(s_alarmTimer, (uint64_t)MSG_ALARM_PULSE_MS * 1000ULL);
}

// ---------------------------------------------------------------------------
// Helpers: trim, uppercase
// ---------------------------------------------------------------------------
static void trimUpper(char *s) {
    // trim
    char *start = s;
    while (*start && isspace((unsigned char)*start))
        start++;
    if (start != s)
        memmove(s, start, strlen(start) + 1);
    size_t len = strlen(s);
    while (len > 0 && isspace((unsigned char)s[len - 1]))
        s[--len] = 0;
    for (size_t i = 0; i < len; i++)
        s[i] = toupper((unsigned char)s[i]);
}

// Compares two callsigns ignoring any "-SSID" suffix, so a message sent to
// "N0CALL", "N0CALL-0".."N0CALL-15" (or any other/garbled SSID) is treated
// as addressed to station "N0CALL". Case-insensitive; SSID digits themselves
// are not validated, only stripped.
static bool callsignBaseMatch(const char *a, const char *b) {
    size_t na = 0, nb = 0;
    while (a[na] && a[na] != '-')
        na++;
    while (b[nb] && b[nb] != '-')
        nb++;
    if (na == 0 || na != nb)
        return false;
    return strncasecmp(a, b, na) == 0;
}

// ---------------------------------------------------------------------------
// Queue management
// ---------------------------------------------------------------------------
int pkgMsg_Find(const char *call, uint16_t msgID, bool rxtx) {
    // Exact match only. s_queue[i].callsign is always NUL-terminated (see
    // pkgMsgUpdate(), which memset()s the field before strncpy()), so a
    // plain strcmp() is safe here. A substring search would be wrong: a stored
    // "N0CALL" would match an incoming "N0CALL-9" and vice versa, and two
    // unrelated callsigns could coincidentally overlap, letting an ack/reply
    // from the wrong station mark another station's queued message as
    // acknowledged, or a new outgoing message overwrite an unrelated in-flight
    // queue slot.
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (s_queue[i].used && s_queue[i].msgID == msgID && s_queue[i].rxtx == rxtx && strcmp(s_queue[i].callsign, call) == 0)
            return i;
    }
    return -1;
}

static int pkgMsgOldestSlot(void) {
    int ret = 0;
    time_t minimum = time(NULL) + 86400;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used)
            return i;
        if (s_queue[i].time < minimum) {
            minimum = s_queue[i].time;
            ret = i;
        }
    }
    return ret;
}

static int pkgMsgUpdate(const char *call, const char *text, uint16_t msgID, int8_t ack, bool rxtx) {
    if (!call[0] || !text[0])
        return -1;

    int i = pkgMsg_Find(call, msgID, rxtx);
    if (i < 0)
        i = pkgMsgOldestSlot();

    s_queue[i].used = true;
    s_queue[i].time = time(NULL);
    s_queue[i].msgID = msgID;
    s_queue[i].ack = ack;
    s_queue[i].rxtx = rxtx;
    memset(s_queue[i].callsign, 0, sizeof(s_queue[i].callsign));
    strncpy(s_queue[i].callsign, call, sizeof(s_queue[i].callsign) - 1);
    strncpy(s_queue[i].text, text, sizeof(s_queue[i].text) - 1);
    s_queue[i].text[sizeof(s_queue[i].text) - 1] = 0;
    return i;
}

size_t message_dump_json(char *out, size_t out_size) {
    if (out == NULL || out_size < 4)
        return 0;

    // Sort by time, oldest first, so the chat page can just append in
    // received order. MSG_QUEUE_SIZE is small (20), so a plain selection
    // sort over an index array is more than fast enough here and avoids
    // touching s_queue's own layout.
    int order[MSG_QUEUE_SIZE];
    int n_used = 0;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (s_queue[i].used)
            order[n_used++] = i;
    }
    for (int a = 0; a < n_used - 1; a++) {
        int best = a;
        for (int b = a + 1; b < n_used; b++) {
            if (s_queue[order[b]].time < s_queue[order[best]].time)
                best = b;
        }
        if (best != a) {
            int tmp = order[a];
            order[a] = order[best];
            order[best] = tmp;
        }
    }

    size_t pos = 0;
    out[pos++] = '[';
    bool first = true;

    for (int k = 0; k < n_used && pos + 4 < out_size; k++) {
        msg_entry_t *e = &s_queue[order[k]];

        char call_esc[sizeof(e->callsign) * 2];
        char text_esc[MSG_TEXT_MAX * 2];
        json_escape(e->callsign, call_esc, sizeof(call_esc));
        json_escape(e->text, text_esc, sizeof(text_esc));

        const char *status = e->rxtx ? "rx" : (e->ack > 0 ? "pending" : "sent");

        int len = snprintf(out + pos, out_size - pos, "%s{\"time\":%lld,\"dir\":\"%s\",\"call\":\"%s\",\"text\":\"%s\",\"status\":\"%s\"}", first ? "" : ",",
                           (long long)e->time, e->rxtx ? "rx" : "tx", call_esc, text_esc, status);
        if (len < 0)
            break;
        if (pos + (size_t)len + 2 >= out_size)
            break; // would overflow on the closing ']' - stop, keep what we have
        pos += (size_t)len;
        first = false;
    }

    out[pos++] = ']';
    out[pos] = 0;
    return pos;
}

// Builds and sends one packet per enabled channel from a shared "info"
// field (":ADDRESSEE:text{id" or ":ADDRESSEE:ackNNN"), rather than one
// packet reused verbatim on both channels.
//
// The RF leg gets the operator-configured digipeater path (g_config.msg_path,
// resolved by aprs_path_build_suffix_from_config()). The APRS-IS leg does not:
// WIDEn-N aliases are RF-only and meaningless (and misleading to other IS
// clients/servers) once a packet is injected straight into APRS-IS. Per
// APRS-IS convention, locally-originated traffic sent to the IS network
// carries a "TCPIP*" q-construct tag in its path instead of an RF unproto path
// - see aprsc/javAPRSSrvr behavior and the APRS-IS server spec - so the IS leg
// carries "TCPIP*" rather than something like "WIDE1-1,WIDE2-1".
static void txPacket(const char *myCall, const char *info) {
    if (!s_txHandler) {
        ESP_LOGW(TAG, "No TX handler registered, dropping: %s", info);
        return;
    }
    // str_append() reports whether the whole frame fit and leaves len at the
    // number of characters actually written. Both matter here: len is handed
    // straight to the TX handler, which memcpy()s and send()s exactly that
    // many bytes from packet[], so it has to be a count of what is really in
    // the buffer. A frame that does not fit is dropped with a warning rather
    // than sent short - the same discipline the beacon builders follow -
    // because a truncated APRS message loses its trailing "{id" sequence
    // suffix and would never be acked.
    if (g_config.msg_rf) {
        // The path presets are snapshotted under app_config_lock() inside the
        // builder; msg_path itself is a single byte, read here the same way the
        // msg_rf/msg_inet flags around it are.
        char path[80];
        aprs_path_build_suffix_from_config(g_config.msg_path, path, sizeof(path));
        char packet[400];
        size_t len = 0;
        if (str_append(packet, sizeof(packet), &len, "%s>APE32L%s:%s", myCall, path, info))
            s_txHandler(packet, len, MSG_CHANNEL_RF);
        else
            ESP_LOGW(TAG, "RF message too long for a %u byte frame, dropped: %s", (unsigned)sizeof(packet), info);
    }
    if (g_config.msg_inet) {
        char packet[400];
        size_t len = 0;
        if (str_append(packet, sizeof(packet), &len, "%s>APE32L,TCPIP*:%s", myCall, info))
            s_txHandler(packet, len, MSG_CHANNEL_INET);
        else
            ESP_LOGW(TAG, "INET message too long for a %u byte frame, dropped: %s", (unsigned)sizeof(packet), info);
    }
}

void sendAPRSMessage(const char *toCall, const char *text) {
    if (!toCall[0] || !text[0])
        return;
    // Bump the outbound APRS message number used in the "{NN" suffix. The
    // number must always increment and must never come out as 0: a "{0"
    // suffix is read by many APRS clients (UI-View / APRSIS32 / Xastir) as
    // "no message number", so the message would never get acked. On the
    // uint16_t wrap (65535 -> 0) skip straight back to 1 instead of 0.
    if (++s_msgID == 0)
        s_msgID = 1;

    char myCallUp[10];
    app_config_lock();
    strncpy(myCallUp, g_config.msg_mycall, sizeof(myCallUp) - 1);
    app_config_unlock();
    myCallUp[sizeof(myCallUp) - 1] = 0;
    trimUpper(myCallUp);

    char toCallUp[10];
    strncpy(toCallUp, toCall, sizeof(toCallUp) - 1);
    toCallUp[sizeof(toCallUp) - 1] = 0;
    trimUpper(toCallUp);

    char toCallFixed[10];
    memset(toCallFixed, ' ', 9);
    toCallFixed[9] = 0;
    memcpy(toCallFixed, toCallUp, strlen(toCallUp) > 9 ? 9 : strlen(toCallUp));

    char payload[300];
    strncpy(payload, text, sizeof(payload) - 1);
    payload[sizeof(payload) - 1] = 0;

    char info[320];
    snprintf(info, sizeof(info), ":%s:%s{%u", toCallFixed, payload, (unsigned)s_msgID);

    txPacket(myCallUp, info);
    ESP_LOGD(TAG, "Send APRS message to %s msgID %u: %s", toCall, (unsigned)s_msgID, info);

    int8_t ackVal = (g_config.msg_retry == 0) ? -2 : (int8_t)g_config.msg_retry;
    pkgMsgUpdate(toCall, text, s_msgID, ackVal, false);
}

void sendAPRSAck(const char *toCall, const char *msgNo) {
    char toCallFixed[10];
    memset(toCallFixed, ' ', 9);
    toCallFixed[9] = 0;
    size_t n = strlen(toCall);
    memcpy(toCallFixed, toCall, n > 9 ? 9 : n);

    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();

    char info[160];
    snprintf(info, sizeof(info), ":%s:ack%s", toCallFixed, msgNo);
    txPacket(myCall, info);
    ESP_LOGD(TAG, "Send APRS ACK to %s msgNo %s", toCall, msgNo);
}

int message_send_pending_to(const char *toCall) {
    if (toCall == NULL || toCall[0] == 0)
        return 0;

    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();

    int sent = 0;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        // ack > 0 is the "outbound and still waiting for an ack" state; an
        // acked (-2), rejected (-3) or received (-1) entry is not something
        // this station is holding for the querying operator.
        if (!s_queue[i].used || s_queue[i].rxtx || s_queue[i].ack <= 0)
            continue;
        if (!callsignBaseMatch(s_queue[i].callsign, toCall))
            continue;

        // The retry counter and timestamp are deliberately left alone: this
        // transmission answers a query, so it must not spend one of the
        // message's own delivery attempts nor push the next scheduled retry
        // out by one interval.
        char toCallFixed[10];
        memset(toCallFixed, ' ', 9);
        toCallFixed[9] = 0;
        size_t n = strlen(s_queue[i].callsign);
        memcpy(toCallFixed, s_queue[i].callsign, n > 9 ? 9 : n);

        char payload[300];
        strncpy(payload, s_queue[i].text, sizeof(payload) - 1);
        payload[sizeof(payload) - 1] = 0;

        char info[320];
        snprintf(info, sizeof(info), ":%s:%s{%u", toCallFixed, payload, (unsigned)s_queue[i].msgID);
        txPacket(myCall, info);
        sent++;
    }

    if (sent > 0)
        ESP_LOGI(TAG, "?APRSM from %s answered with %d pending message(s)", toCall, sent);
    return sent;
}

void sendAPRSMessageRetry(void) {
    time_t now = time(NULL);

    // Snapshot the own-call once, so a web save can't rewrite it mid-loop
    // while frames are being built.
    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();

    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used || s_queue[i].ack <= 0)
            continue;
        if ((now - s_queue[i].time) <= g_config.msg_interval)
            continue;

        // Stamp the moment this retry is sent. The guard above compares
        // (now - time) against msg_interval, so the timestamp must be the
        // instant of the last transmission for the next attempt to fall
        // exactly one msg_interval later.
        if (--s_queue[i].ack > 0)
            s_queue[i].time = now;

        char toCallFixed[10];
        memset(toCallFixed, ' ', 9);
        toCallFixed[9] = 0;
        size_t n = strlen(s_queue[i].callsign);
        memcpy(toCallFixed, s_queue[i].callsign, n > 9 ? 9 : n);

        char payload[300];
        strncpy(payload, s_queue[i].text, sizeof(payload) - 1);
        payload[sizeof(payload) - 1] = 0;

        char info[320];
        snprintf(info, sizeof(info), ":%s:%s{%u", toCallFixed, payload, (unsigned)s_queue[i].msgID);
        txPacket(myCall, info);
        ESP_LOGD(TAG, "Retry APRS message[%d] to %s msgID %u ack left %d", i, s_queue[i].callsign, (unsigned)s_queue[i].msgID, s_queue[i].ack);
    }
}

// ---------------------------------------------------------------------------
// Incoming
// ---------------------------------------------------------------------------
void handleIncomingAPRS(const char *line) {
    const char *msgMarker = strstr(line, "::");
    if (msgMarker == NULL || msgMarker == line)
        return;

    char fromCall[16] = { 0 };
    const char *gt = strchr(line, '>');
    if (gt) {
        size_t n = (size_t)(gt - line);
        if (n >= sizeof(fromCall))
            n = sizeof(fromCall) - 1;
        memcpy(fromCall, line, n);
    }

    const char *payload = msgMarker + 2;
    if (strlen(payload) < 10)
        return;

    char toCall[12] = { 0 };
    memcpy(toCall, payload, 9);
    trimUpper(toCall);

    if (strcasecmp(fromCall, toCall) == 0)
        return; // message to self, ignore

    const char *colon = strchr(payload + 9, ':');
    if (colon == NULL)
        return;

    // Directed query ("CALL:?query?") shares this same ":ADDRESSEE:" framing
    // but is not an APRS message: hand it to the query responder's own
    // addressee-parsing entry point instead of duplicating it here, and skip
    // the message-specific logic below entirely. Checked - and dispatched -
    // regardless of g_config.msg_enable, since the two features are
    // independently enabled (g_config.query_en gates it inside query.c).
    if (colon[1] == '?') {
        // The whole line goes along with the split-out fields: a "?APRST" /
        // "?PING?" answer reports the route the query travelled, which only
        // the unparsed line still carries.
        query_process_directed(fromCall, toCall, colon + 1, line);
        return;
    }

    if (!g_config.msg_enable)
        return;

    char message[300] = { 0 };
    strncpy(message, colon + 1, sizeof(message) - 1);
    // trim trailing whitespace/CR
    size_t mlen = strlen(message);
    while (mlen > 0 && isspace((unsigned char)message[mlen - 1]))
        message[--mlen] = 0;

    char msgNo[12] = { 0 };
    char *brace = strchr(message, '{');
    if (brace && brace[1]) {
        strncpy(msgNo, brace + 1, sizeof(msgNo) - 1);
        *brace = 0;
        mlen = strlen(message);
        while (mlen > 0 && isspace((unsigned char)message[mlen - 1]))
            message[--mlen] = 0;
    }

    bool isAck = (strncmp(message, "ack", 3) == 0);
    if (isAck)
        strncpy(msgNo, message + 3, sizeof(msgNo) - 1);

    bool isRej = (strncmp(message, "rej", 3) == 0);
    if (isRej)
        strncpy(msgNo, message + 3, sizeof(msgNo) - 1);

    ESP_LOGD(TAG, "Message from %s to %s: %s", fromCall, toCall, message);

    // Accept the message if the addressee's base callsign matches ours,
    // regardless of SSID on either side (message to "N0CALL", "N0CALL-7",
    // etc. is accepted as long as it's configured mycall is "N0CALL", with
    // or without its own SSID).
    if (!callsignBaseMatch(toCall, g_config.msg_mycall))
        return;

    // An ack or rej always carries a message ID (it's the ID of the queued
    // message being acknowledged/rejected); without one there is nothing to
    // match against a queued outgoing message, so it can't be processed.
    if ((isAck || isRej) && msgNo[0] == 0)
        return;

    if (isAck) {
        int i = pkgMsg_Find(fromCall, (uint16_t)atoi(msgNo), false);
        if (i >= 0)
            s_queue[i].ack = -2; // acked
        return;
    }

    if (isRej) {
        int i = pkgMsg_Find(fromCall, (uint16_t)atoi(msgNo), false);
        if (i >= 0)
            s_queue[i].ack = -3; // rejected by recipient: stop retrying, don't count as delivered
        return;
    }

    char decoded[300];
    strncpy(decoded, message, sizeof(decoded) - 1);
    decoded[sizeof(decoded) - 1] = 0;

    size_t dlen = strlen(decoded);
    while (dlen > 0 && isspace((unsigned char)decoded[dlen - 1]))
        decoded[--dlen] = 0;
    if (dlen == 0)
        return;

    pkgMsgUpdate(fromCall, decoded, (uint16_t)atoi(msgNo), -1, true);
    // Per APRS101 the message ID is optional: only send an ack when the
    // sender actually requested one.
    if (msgNo[0] != 0)
        sendAPRSAck(fromCall, msgNo);
    message_alarm_pulse();
}
